import numpy as np

# ================= 1. 机械臂网络配置 =================
ROBOT_IP = "192.168.x.x" #机械臂ip
ROBOT_PORT = 30004
DEFAULT_SPEED = 0.1          # 安全起见，初始速度比率设为 10%

# ================= 2. 硬件控制指令 (Modbus & IO) =================
# 根据示教器确认：变量名为 Modbus_12
GRIPPER_ADDR = "Modbus_12"
G_OPEN  = 1000
G_CLOSE = 0

# 传送带控制
CONVEYOR_DO_PIN = 0
CONVEYOR_RUN = 1
CONVEYOR_STOP = 0

# ================= 3. 坐标点位配置 (单位：mm) =================
# 【拍照点】已按要求修改 Z 为 445.0
SCAN_X = -97.94
SCAN_Y = -434.78
SCAN_Z = 445.0

# 【工作台抓取深度】
GRASP_Z_WORKBENCH = 203

# 【传送带放置点】
PLACE_X_CONVEYOR = 323.54
PLACE_Y_CONVEYOR = -196.69
PLACE_Z_CONVEYOR = 176.0

# 【安全横移高度】
SAFE_Z_HEIGHT = 450.0

# ================= 4. 姿态锁定 (RX, RY, RZ) =================
FIXED_RX = -3.138
FIXED_RY = 0.000
FIXED_RZ = 1.570

# ================= 5. 视觉大脑配置 =================
VISION_HOST = "0.0.0.0"
VISION_PORT = 10086

# ================= 6. 关节安全回位点 =================
HOME_JOINTS = [0.0, -0.2618, 1.7453, 0.4363, 1.5708, 0.0]

# ================= 7. 左侧阵列装配台 (单位：mm) =================
# 传送带左侧尽头盲抓点（X和Z完美复用放置点，只更新Y为 73.31）
PICK_Y_CONVEYOR = 73.31

# 三个铁杆的装配目标点位 (统一 Z 轴下探深度为 205)
PEG_POSITIONS = [
    [78.19, 417.56, 205.0],   # 铁杆 1
    [202.08, 373.45, 205.0],  # 铁杆 2
    [246.47, 495.82, 205.0]   # 铁杆 3
]

# ================= 8. 视觉环境补偿 (单位：mm) =================
# 用于应对白天/夜晚光线变化导致的固定视觉漂移
VISION_OFFSET_X = 0.0  #  X 轴准
VISION_OFFSET_Y = -1.5  # 晚上 Y 轴偏左